%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%          激光IMU误差模型（非随机性误差）
%  输入：
%  Wibb       机体系陀螺仪输出   （单位：弧度/秒）
%  Fb         机体系加速度计输出 （单位：米/秒/秒）
%  输出：
%  Gyro_fix   机体系陀螺仪固定误差输出   （单位：弧度/秒）
%  Acc_fix    机体系加速度计固定误差输出 （单位：米/秒/秒）
%
%                           程序设计：熊智  日期：2002/8/16
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


function [Gyro_fix,Acc_fix]=imu_err(Wibb,Fb)

g=9.7803698;         %重力加速度    （单位：米/秒/秒）
Wie=7.292115147e-5;  %地球自转角速度（单位：弧度/秒）
deg_rad=0.01745329252e0;% Transfer from angle degree to rad

%%%%%%%%%%%非随机误差矩阵(刻度系数和安装误差)%%%%%%%%%%%
Da_bias=[0.0001; 0.0001; 0.0001]*g;  %零偏
Ka_bias=diag([0.0001 0.0001 0.0001]);   %刻度系数误差阵(<200PPM)
Aa_bias=zeros(3,3);                  %安装误差阵(1''-10'')

Aa_bias=[ 0.0                 pi*5.0/3600.0/180.0  -1.0*pi*5.0/3600.0/180.0;
         -1.0*pi*5.0/3600.0/180.0   0                   pi*5.0/3600.0/180.0;
          pi*5.0/3600.0/180.0  -1.0*pi*5.0/3600.0/180.0   0.0
        ];
  %加速度计

Kg_bias=diag([0.00005 0.00005 0.00005]); %刻度系数误差阵(5-50PPM)
Ag_bias=zeros(3,3);                   %安装误差阵(1''-10'')

Ag_bias=[ 0.0                 pi*3/3600.0/180.0  -1.0*pi*3/3600.0/180.0;
         -1.0*pi*3/3600.0/180.0   0                   pi*3/3600.0/180.0;
          pi*3/3600.0/180.0  -1.0*pi*3/3600.0/180.0   0.0
        ];
  %陀螺仪
 
 %Fb=(eye(3))*Fb+Da_bias;
 %Wibb=(eye(3))*Wibb+Dg_bias;
  
 %Fb=(eye(3)+Ka_bias)*Fb;
 %Wibb=(eye(3)+Kg_bias)*Wibb;
             
 %Fb=(eye(3)+Aa_bias)*Fb;
 %Wibb=(eye(3)+Ag_bias)*Wibb;
 
 Acc_fix=(Ka_bias+Aa_bias)*Fb+Da_bias;
 Gyro_fix=(Kg_bias+Ag_bias)*Wibb;
   %加入非随机性误差
   
  
 
 
 
 